#tax
income = float(input())
tax = 0
'''
#เวลาเทียบให้เทียบขากเพดานภาษีในช่วง เพราะว่าเราจะดูว่าทันจะมีส่วนเกินรึเปล่า
(เพราะว่าincome มันลบไปแล่ว ลบเพดานก็เหมือนลบtotalแต่ละชี้น)
เช่น
มี5000000
แบ่งเป็น 100000 400000 500000 1e6 3e6  ต้องใช้ช่วงนี้เทียบ
total 100000 500000 1e6    4e6 4e6+++
'''
#versionกากสัสๆ คิดเยอะ
if 1<=income<1e5:
    tax += income*5/100    
elif income>=1e5:
    tax += 1e5*5/100
    income -= 1e5
    if income<4e5: #income= income_total-1e5 < 4e5 income_total<5e5...
        tax += income*10/100
    elif income>=4e5:
        tax += 4e5 *10/100 #รวมกับแสนแรกละจะได้ 1e5+4e5$$$ =5e5 ไม่ใช่เริ่มจากใหม่
        income -= 4e5    #$$$
        if income<5e5:
            tax += income*20/100
        elif income>=5e5:
            tax += 5e5 *20/100 #1e5+4e5 +5e5$$$ =1e6
            income -= 5e5 #$$$
            if income<3e6:
                tax += income*30/100
            elif income>= 3e6:
                tax+= 3e6 *30/100 #1e5+4e5 +5e5 +(3e6)$$$ =4e6
                income -= 3e6 #$$$
                tax += income*37/100 #ไม่เหลือไรจะลบละ
print(tax)
#--------------------------------

#Versionที่คิดก่อนนอกกระดาษ
#แบ่งเป็น 100000 400000 500000 1e6 3e6  ต้องใช้ช่วงนี้เทียบ(ราคาสะสม)
n = float(input())
t = 0
if 1<=n<=1e5:
  t += n*0.05
elif 1e5+1<=n<=5e5:
  t += (n-1e5)*0.10 + 5000 #100000*0.5
elif 5e5+1<=n<=1e6:
  t += (n-5e5)*0.20 +45000 #100000*0.5 + 400000*0.1
elif 1e6+1<=n<=4e6:
  t += (n-1e6)*0.30 +145000 #100000*0.5 + 400000*0.1 + 500000*0.2
elif n>=4e6+1:
  t += (n-4e6)*0.37 +1045000 #100000*0.5 + 400000*0.1 + 500000*0.2 +1e6*0.3
print(float(t))
