'''
โปรแกรมที่แสดงด้านล่างท าการค านวณราคาสินค้าที่ต้องช าระหลังใช้คูปองและ/หรือบัตรสมาชิก ดังนี้
มีคูปอง ? มีบัตรสมาชิก ? ส่วนลดที่ได้
N N 0 %
Y N 5 %
N Y 10 %
Y Y 20 %
โปรแกรมดังกล่าวมีข้อผิดพลาดอยู่หลายจุด ให้แก้ไขโปรแกรมให้สามารถท างานได้ถูกต้อง (พยายามหาจุดที่ผิดให้เจอโดย
ไม่เขียนโปรแกรมใหม่และท าการแก้ไข เพื่อฝึกการหาข้อผิดพลาดของโปรแกรม ซึ่งจะเป็นประโยชน์ส าหรับการสอบ)

ข้อมูลน ำเข้ำ
มี3 บรรทัด บรรทัดแรกระบุราคาสินค้าเป็นจ านวนจริง บรรทัดที่ 2 ระบุว่ามีคูปองหรือไม่ (Y หรือ N) และบรรทัดที่ 3 ระบุว่า
มีบัตรสมาชิกหรือไม่ (Y หรือ N)
ข้อมูลส่งออก
มีบรรทัดเดียว แสดงราคาสินค้าที่ต้องช าระหลังหักส่วนลดแล้ว
'''


price = float(input())
coupon = input().strip()
card = input().strip()
discount = 0
if coupon == "Y":
 discount += 5
if card == "Y":
 if discount > 0:
     discount += 15
 else:
     discount += 10
print( price*((100-discount)/100) )
