#คล้ายๆtaxเลยที่มันคิดจากระยะสะสท 10 = (1+9)=10
# 11 = 1+9+1
# 21 = 1+9+10+1
#31 = 1+9+10+20
# 1 9 10 20 20 20
import math
d = float(input())
p = 0
if d<0:
    print('ERROR')
else:
    if d<=1 :
        p += 35.00
    elif 1<d<=10:
        p += 35.00 + 5.50 * math.ceil(d-1) #ระยะที่หักไปแล้ว 1 
    elif 10<d<=20:
        p += 35.00 + 5.50*9 + 6.50*math.ceil(d-10) #ระยะที่หักไปแล้ว 1+9
    elif 20<d<=40:
        p += 35.00 + 5.50*9 + 6.50*10 +7.50*math.ceil(d-20) #ระยะที่หักไปแล้ว 1+9+10
    elif 40<d<=60:
        p += 35.00 + 5.50*9 + 6.50*10 +7.50*20 + 8.00*math.ceil(d-40) #ระยะที่หักไปแล้ว 1+9+10+20
    elif 60<d<=80:
        p += 35.00 + 5.50*9 + 6.50*10 +7.50*20 + 8.00*20 + 9.00*math.ceil(d-60) #ระยะที่หักไปแล้ว 1+9+10+20+20
    elif d>80:
        p += 35.00 + 5.50*9 + 6.50*10 +7.50*20 + 8.00*20 + 9.00*20 + 10.50*math.ceil(d-80)
    print(p)

        
